; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p6---int100n150-m25---int100c150---s40---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level19 level19)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level19 level20)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level19 level21)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level19 level22)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level19 level23)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level19 level24)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level19 level25)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level19 level26)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level19 level27)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level19 level28)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level19 level29)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level19 level30)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level19 level31)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level19 level32)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level19 level33)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level19 level34)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level19 level35)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level19 level36)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level19 level37)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level19 level38)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level19 level39)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level19 level40)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level19 level41)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level19 level42)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level19 level43)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level19 level44)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level19 level45)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level37 level6 level43)
(sum level38 level6 level44)
(sum level39 level6 level45)

(connected l0 l1)
(fuelcost level19 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l1 l0)
(fuelcost level19 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)

(at t0 l1)
(fuel t0 level45)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l1)
(at p5 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
(at p3 l2)
(at p4 l0)
(at p5 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 6
2. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 6
3. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 6
4. (drive t0 l1 l0 level26 level19 level45)
   deleted: (at t0 l1) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 0 of 6
5. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 6
6. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 6
7. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 6
8. (drive t0 l0 l2 level20 level6 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l2) (fuel t0 level20)
   goals met: 1 of 6
9. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 1 of 6
10. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 2 of 6
11. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 6
12. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 4 of 6
13. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 5 of 6
14. (drive t0 l2 l1 level11 level9 level20)
   deleted: (at t0 l2) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 5 of 6
15. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 6 of 6
